#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-kqYdBiVgzKHBUi2D

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_route_table_association.public-access: Refreshing state... [id=rtbassoc-0d45c771a2ccc00ed]
aws_vpc.lab: Refreshing state... [id=vpc-0a21f14fc3a6a4451]
aws_subnet.lab-public: Refreshing state... [id=subnet-0d090d081e5d92146]
aws_security_group.webserver-SG: Refreshing state... [id=sg-011dc642cffcdd4f8]
aws_instance.EC2[0]: Refreshing state... [id=i-042bd0cc65cca7c72]
aws_instance.EC2[1]: Refreshing state... [id=i-06d23e108459b8b9c]
aws_internet_gateway.lab: Refreshing state... [id=igw-0c389dafb760e2264]
aws_route_table.lab: Refreshing state... [id=rtb-09dd0a51fab67a978]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.EC2[0] will be destroyed
  # (because aws_instance.EC2 is not in configuration)
  - resource "aws_instance" "EC2" {
      - ami                                  = "ami-006dcf34c09e50022" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-042bd0cc65cca7c72" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-042bd0cc65cca7c72" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "kris_desktop" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-06b9b7a4cd6e10556" -> null
      - private_dns                          = "ip-10-0-1-55.ec2.internal" -> null
      - private_ip                           = "10.0.1.55" -> null
      - public_dns                           = "ec2-54-146-185-142.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.146.185.142" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0d090d081e5d92146" -> null
      - tags                                 = {
          - "Name" = "EC2-development-0"
        } -> null
      - tags_all                             = {
          - "Name" = "EC2-development-0"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "b9dd2f9c089c82307afbfe0668ddceb0c8368514" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-011dc642cffcdd4f8",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-09814833a7f999e5c" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.EC2[1] will be destroyed
  # (because aws_instance.EC2 is not in configuration)
  - resource "aws_instance" "EC2" {
      - ami                                  = "ami-006dcf34c09e50022" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-06d23e108459b8b9c" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-06d23e108459b8b9c" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "kris_desktop" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-06043c9b6f74977d0" -> null
      - private_dns                          = "ip-10-0-1-90.ec2.internal" -> null
      - private_ip                           = "10.0.1.90" -> null
      - public_dns                           = "ec2-18-206-88-184.compute-1.amazonaws.com" -> null
      - public_ip                            = "18.206.88.184" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0d090d081e5d92146" -> null
      - tags                                 = {
          - "Name" = "EC2-development-1"
        } -> null
      - tags_all                             = {
          - "Name" = "EC2-development-1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "b9dd2f9c089c82307afbfe0668ddceb0c8368514" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-011dc642cffcdd4f8",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-03c01c68d54a229fa" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.EC2-0 will be created
  + resource "aws_instance" "EC2-0" {
      + ami                                  = "ami-006dcf34c09e50022"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "kris_desktop"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "EC2-development-0"
        }
      + tags_all                             = {
          + "Name" = "EC2-development-0"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b9dd2f9c089c82307afbfe0668ddceb0c8368514"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.EC2-1 will be created
  + resource "aws_instance" "EC2-1" {
      + ami                                  = "ami-006dcf34c09e50022"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "kris_desktop"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "EC2-development-1"
        }
      + tags_all                             = {
          + "Name" = "EC2-development-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b9dd2f9c089c82307afbfe0668ddceb0c8368514"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.EC2-2 will be created
  + resource "aws_instance" "EC2-2" {
      + ami                                  = "ami-006dcf34c09e50022"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "kris_desktop"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "EC2-development-2"
        }
      + tags_all                             = {
          + "Name" = "EC2-development-2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b9dd2f9c089c82307afbfe0668ddceb0c8368514"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_lb_target_group.lab will be created
  + resource "aws_lb_target_group" "lab" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "development-lb-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0a21f14fc3a6a4451"
    }

  # aws_route_table_association.public-access will be destroyed
  # (because aws_route_table_association.public-access is not in configuration)
  - resource "aws_route_table_association" "public-access" {
      - id             = "rtbassoc-0d45c771a2ccc00ed" -> null
      - route_table_id = "rtb-09dd0a51fab67a978" -> null
      - subnet_id      = "subnet-0d090d081e5d92146" -> null
    }

  # aws_route_table_association.public-access-0 will be created
  + resource "aws_route_table_association" "public-access-0" {
      + id             = (known after apply)
      + route_table_id = "rtb-09dd0a51fab67a978"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-access-1 will be created
  + resource "aws_route_table_association" "public-access-1" {
      + id             = (known after apply)
      + route_table_id = "rtb-09dd0a51fab67a978"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-access-2 will be created
  + resource "aws_route_table_association" "public-access-2" {
      + id             = (known after apply)
      + route_table_id = "rtb-09dd0a51fab67a978"
      + subnet_id      = (known after apply)
    }

  # aws_security_group.lab will be created
  + resource "aws_security_group" "lab" {
      + arn                    = (known after apply)
      + description            = "allow SSH and HTTP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Everything"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "development-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a21f14fc3a6a4451"
    }

  # aws_security_group.webserver-SG will be destroyed
  # (because aws_security_group.webserver-SG is not in configuration)
  - resource "aws_security_group" "webserver-SG" {
      - arn                    = "arn:aws:ec2:us-east-1:949471431711:security-group/sg-011dc642cffcdd4f8" -> null
      - description            = "allow SSH and HTTP" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow Everything"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-011dc642cffcdd4f8" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow SSH"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "allow http"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "webserver-SG" -> null
      - owner_id               = "949471431711" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0a21f14fc3a6a4451" -> null
    }

  # aws_subnet.lab-public will be destroyed
  # (because aws_subnet.lab-public is not in configuration)
  - resource "aws_subnet" "lab-public" {
      - arn                                            = "arn:aws:ec2:us-east-1:949471431711:subnet/subnet-0d090d081e5d92146" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d090d081e5d92146" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "949471431711" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "development-SN-public"
        } -> null
      - tags_all                                       = {
          - "Name" = "development-SN-public"
        } -> null
      - vpc_id                                         = "vpc-0a21f14fc3a6a4451" -> null
    }

  # aws_subnet.lab-public-0 will be created
  + resource "aws_subnet" "lab-public-0" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "development-SN-public-0"
        }
      + tags_all                                       = {
          + "Name" = "development-SN-public-0"
        }
      + vpc_id                                         = "vpc-0a21f14fc3a6a4451"
    }

  # aws_subnet.lab-public-1 will be created
  + resource "aws_subnet" "lab-public-1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "development-SN-public-1"
        }
      + tags_all                                       = {
          + "Name" = "development-SN-public-1"
        }
      + vpc_id                                         = "vpc-0a21f14fc3a6a4451"
    }

  # aws_subnet.lab-public-2 will be created
  + resource "aws_subnet" "lab-public-2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "development-SN-public-2"
        }
      + tags_all                                       = {
          + "Name" = "development-SN-public-2"
        }
      + vpc_id                                         = "vpc-0a21f14fc3a6a4451"
    }

Plan: 11 to add, 0 to change, 5 to destroy.


```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*